benchmark/leveldb/results/large-ratio/mris_ratio_hybrid.32.3.log
LevelDB:    version 1.5
Date:       Thu Dec  6 23:27:55 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    2397.002 micros/op;    4.7 MB/s small: 10000/0; big: 313/0
Microseconds per op:
Count: 10313  Average: 2397.0227  StdDev: 13247.00
Min: 0.0000  Median: 731.3953  Max: 371594.0000
------------------------------------------------------
[       0,       1 )      11   0.107%   0.107% 
[       1,       2 )      16   0.155%   0.262% 
[       2,       3 )      18   0.175%   0.436% 
[       3,       4 )       5   0.048%   0.485% 
[      18,      20 )       2   0.019%   0.504% 
[      20,      25 )      22   0.213%   0.718% 
[      25,      30 )      93   0.902%   1.619% 
[      30,      35 )     228   2.211%   3.830% 
[      35,      40 )    1068  10.356%  14.186% ##
[      40,      45 )     677   6.565%  20.751% #
[      45,      50 )      74   0.718%  21.468% 
[      50,      60 )      89   0.863%  22.331% 
[      60,      70 )      11   0.107%  22.438% 
[      70,      80 )       8   0.078%  22.515% 
[      80,      90 )     464   4.499%  27.014% #
[      90,     100 )     757   7.340%  34.355% #
[     100,     120 )     691   6.700%  41.055% #
[     120,     140 )     388   3.762%  44.817% #
[     140,     160 )     210   2.036%  46.853% 
[     160,     180 )     117   1.134%  47.988% 
[     180,     200 )      76   0.737%  48.725% 
[     200,     250 )      52   0.504%  49.229% 
[     250,     300 )      12   0.116%  49.345% 
[     300,     350 )       3   0.029%  49.375% 
[     400,     450 )      14   0.136%  49.510% 
[     450,     500 )      10   0.097%  49.607% 
[     500,     600 )      21   0.204%  49.811% 
[     600,     700 )       6   0.058%  49.869% 
[     700,     800 )      43   0.417%  50.286% 
[     800,     900 )      98   0.950%  51.236% 
[     900,    1000 )     189   1.833%  53.069% 
[    1000,    1200 )     577   5.595%  58.664% #
[    1200,    1400 )     373   3.617%  62.281% #
[    1400,    1600 )    1112  10.783%  73.063% ##
[    1600,    1800 )     162   1.571%  74.634% 
[    1800,    2000 )      30   0.291%  74.925% 
[    2000,    2500 )      58   0.562%  75.487% 
[    2500,    3000 )    1698  16.465%  91.952% ###
[    3000,    3500 )     434   4.208%  96.160% #
[    3500,    4000 )      32   0.310%  96.470% 
[    4000,    4500 )       3   0.029%  96.500% 
[    5000,    6000 )       1   0.010%  96.509% 
[    6000,    7000 )       1   0.010%  96.519% 
[    7000,    8000 )       2   0.019%  96.538% 
[    8000,    9000 )       1   0.010%  96.548% 
[    9000,   10000 )       2   0.019%  96.567% 
[   10000,   12000 )       1   0.010%  96.577% 
[   12000,   14000 )       5   0.048%  96.626% 
[   14000,   16000 )      11   0.107%  96.732% 
[   16000,   18000 )      12   0.116%  96.849% 
[   18000,   20000 )      25   0.242%  97.091% 
[   20000,   25000 )     117   1.134%  98.226% 
[   25000,   30000 )     119   1.154%  99.379% 
[   30000,   35000 )      24   0.233%  99.612% 
[   35000,   40000 )       3   0.029%  99.641% 
[   45000,   50000 )       2   0.019%  99.661% 
[   50000,   60000 )       1   0.010%  99.670% 
[   60000,   70000 )       1   0.010%  99.680% 
[   70000,   80000 )       2   0.019%  99.699% 
[   80000,   90000 )       1   0.010%  99.709% 
[   90000,  100000 )       2   0.019%  99.728% 
[  100000,  120000 )       6   0.058%  99.787% 
[  120000,  140000 )       6   0.058%  99.845% 
[  160000,  180000 )       1   0.010%  99.855% 
[  180000,  200000 )       1   0.010%  99.864% 
[  200000,  250000 )       4   0.039%  99.903% 
[  250000,  300000 )       2   0.019%  99.922% 
[  300000,  350000 )       3   0.029%  99.952% 
[  350000,  400000 )       5   0.048% 100.000% 

----- /mnt/largespace/mris_ratio_hybrid_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	313
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0