benchmark/leveldb/results/large-ratio/mris_ratio_hybrid.64.1.log
LevelDB:    version 1.5
Date:       Thu Dec  6 23:28:22 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1935.569 micros/op;    5.0 MB/s small: 10000/0; big: 157/0
Microseconds per op:
Count: 10157  Average: 1935.5796  StdDev: 12345.40
Min: 0.0000  Median: 733.6957  Max: 692876.0000
------------------------------------------------------
[       0,       1 )       4   0.039%   0.039% 
[       1,       2 )      18   0.177%   0.217% 
[       2,       3 )       8   0.079%   0.295% 
[       3,       4 )       2   0.020%   0.315% 
[       4,       5 )       1   0.010%   0.325% 
[      18,      20 )       1   0.010%   0.335% 
[      20,      25 )      31   0.305%   0.640% 
[      25,      30 )      93   0.916%   1.556% 
[      30,      35 )     242   2.383%   3.938% 
[      35,      40 )    1070  10.535%  14.473% ##
[      40,      45 )     513   5.051%  19.523% #
[      45,      50 )      73   0.719%  20.242% 
[      50,      60 )     123   1.211%  21.453% 
[      60,      70 )      23   0.226%  21.680% 
[      70,      80 )       6   0.059%  21.739% 
[      80,      90 )     507   4.992%  26.730% #
[      90,     100 )     771   7.591%  34.321% ##
[     100,     120 )     675   6.646%  40.967% #
[     120,     140 )     404   3.978%  44.944% #
[     140,     160 )     231   2.274%  47.219% 
[     160,     180 )     104   1.024%  48.243% 
[     180,     200 )      57   0.561%  48.804% 
[     200,     250 )      42   0.414%  49.217% 
[     250,     300 )       9   0.089%  49.306% 
[     300,     350 )       4   0.039%  49.345% 
[     350,     400 )       2   0.020%  49.365% 
[     400,     450 )      14   0.138%  49.503% 
[     450,     500 )      10   0.098%  49.601% 
[     500,     600 )      18   0.177%  49.778% 
[     600,     700 )       7   0.069%  49.847% 
[     700,     800 )      46   0.453%  50.300% 
[     800,     900 )      98   0.965%  51.265% 
[     900,    1000 )     192   1.890%  53.155% 
[    1000,    1200 )     569   5.602%  58.758% #
[    1200,    1400 )     380   3.741%  62.499% #
[    1400,    1600 )    1122  11.047%  73.545% ##
[    1600,    1800 )     178   1.752%  75.298% 
[    1800,    2000 )      29   0.286%  75.583% 
[    2000,    2500 )      64   0.630%  76.213% 
[    2500,    3000 )    1765  17.377%  93.591% ###
[    3000,    3500 )     389   3.830%  97.420% #
[    3500,    4000 )      40   0.394%  97.814% 
[    4000,    4500 )       9   0.089%  97.903% 
[    4500,    5000 )       5   0.049%  97.952% 
[    5000,    6000 )       6   0.059%  98.011% 
[    6000,    7000 )       3   0.030%  98.041% 
[    7000,    8000 )       1   0.010%  98.051% 
[    8000,    9000 )       5   0.049%  98.100% 
[    9000,   10000 )       2   0.020%  98.120% 
[   10000,   12000 )       4   0.039%  98.159% 
[   12000,   14000 )       3   0.030%  98.188% 
[   14000,   16000 )       3   0.030%  98.218% 
[   16000,   18000 )       4   0.039%  98.257% 
[   18000,   20000 )      22   0.217%  98.474% 
[   20000,   25000 )      47   0.463%  98.937% 
[   25000,   30000 )      62   0.610%  99.547% 
[   30000,   35000 )      15   0.148%  99.695% 
[   40000,   45000 )       1   0.010%  99.705% 
[   50000,   60000 )       3   0.030%  99.734% 
[   60000,   70000 )       3   0.030%  99.764% 
[   70000,   80000 )       2   0.020%  99.783% 
[   80000,   90000 )       1   0.010%  99.793% 
[   90000,  100000 )       2   0.020%  99.813% 
[  100000,  120000 )       4   0.039%  99.852% 
[  120000,  140000 )       3   0.030%  99.882% 
[  140000,  160000 )       1   0.010%  99.892% 
[  180000,  200000 )       1   0.010%  99.902% 
[  200000,  250000 )       3   0.030%  99.931% 
[  250000,  300000 )       2   0.020%  99.951% 
[  300000,  350000 )       3   0.030%  99.980% 
[  350000,  400000 )       1   0.010%  99.990% 
[  600000,  700000 )       1   0.010% 100.000% 

----- /mnt/largespace/mris_ratio_hybrid_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	157
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0