benchmark/leveldb/results/large-ratio/mris_ratio_ssd.16.3.log
LevelDB:    version 1.5
Date:       Thu Dec  6 21:33:42 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1684.441 micros/op;    8.7 MB/s small: 10000/0; big: 625/0
Microseconds per op:
Count: 10625  Average: 1684.4600  StdDev: 10165.70
Min: 0.0000  Median: 802.7473  Max: 364924.0000
------------------------------------------------------
[       0,       1 )      70   0.659%   0.659% 
[       1,       2 )     163   1.534%   2.193% 
[       2,       3 )     320   3.012%   5.205% #
[       3,       4 )      62   0.584%   5.788% 
[       4,       5 )       2   0.019%   5.807% 
[       5,       6 )       1   0.009%   5.816% 
[      14,      16 )       2   0.019%   5.835% 
[      20,      25 )      23   0.216%   6.052% 
[      25,      30 )      82   0.772%   6.824% 
[      30,      35 )     193   1.816%   8.640% 
[      35,      40 )     960   9.035%  17.675% ##
[      40,      45 )     576   5.421%  23.096% #
[      45,      50 )      33   0.311%  23.407% 
[      50,      60 )      65   0.612%  24.019% 
[      60,      70 )       8   0.075%  24.094% 
[      70,      80 )       2   0.019%  24.113% 
[      80,      90 )     392   3.689%  27.802% #
[      90,     100 )     732   6.889%  34.692% #
[     100,     120 )     682   6.419%  41.111% #
[     120,     140 )     360   3.388%  44.499% #
[     140,     160 )     222   2.089%  46.588% 
[     160,     180 )     125   1.176%  47.765% 
[     180,     200 )      79   0.744%  48.508% 
[     200,     250 )      49   0.461%  48.969% 
[     250,     300 )      12   0.113%  49.082% 
[     300,     350 )       1   0.009%  49.092% 
[     350,     400 )       1   0.009%  49.101% 
[     400,     450 )      14   0.132%  49.233% 
[     450,     500 )      10   0.094%  49.327% 
[     500,     600 )      21   0.198%  49.525% 
[     600,     700 )      12   0.113%  49.638% 
[     700,     800 )      36   0.339%  49.976% 
[     800,     900 )      91   0.856%  50.833% 
[     900,    1000 )     175   1.647%  52.480% 
[    1000,    1200 )     572   5.384%  57.864% #
[    1200,    1400 )     364   3.426%  61.289% #
[    1400,    1600 )    1095  10.306%  71.595% ##
[    1600,    1800 )     162   1.525%  73.120% 
[    1800,    2000 )      22   0.207%  73.327% 
[    2000,    2500 )      56   0.527%  73.854% 
[    2500,    3000 )    1668  15.699%  89.553% ###
[    3000,    3500 )     412   3.878%  93.431% #
[    3500,    4000 )     113   1.064%  94.494% 
[    4000,    4500 )     177   1.666%  96.160% 
[    4500,    5000 )      57   0.536%  96.696% 
[    5000,    6000 )     144   1.355%  98.052% 
[    6000,    7000 )      91   0.856%  98.908% 
[    7000,    8000 )      81   0.762%  99.671% 
[    8000,    9000 )       3   0.028%  99.699% 
[    9000,   10000 )       1   0.009%  99.708% 
[   10000,   12000 )       2   0.019%  99.727% 
[   16000,   18000 )       1   0.009%  99.736% 
[   20000,   25000 )       2   0.019%  99.755% 
[   30000,   35000 )       3   0.028%  99.784% 
[   35000,   40000 )       1   0.009%  99.793% 
[   40000,   45000 )       1   0.009%  99.802% 
[   50000,   60000 )       1   0.009%  99.812% 
[   90000,  100000 )       2   0.019%  99.831% 
[  100000,  120000 )       2   0.019%  99.849% 
[  120000,  140000 )       3   0.028%  99.878% 
[  140000,  160000 )       1   0.009%  99.887% 
[  180000,  200000 )       2   0.019%  99.906% 
[  200000,  250000 )       4   0.038%  99.944% 
[  300000,  350000 )       4   0.038%  99.981% 
[  350000,  400000 )       2   0.019% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	625
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0